Repository: jakubmieszczanin/joi-messages
Catalog: translations/*.po
Languages: de, et, fr, ja

source: {{#label}} hex decoded representation must be byte aligned
de: {{#label}} hexadezimal dekodierte Darstellung muss byteorientiert sein
et: {{#label}} Hex-dekodeeritud esitus peab olema baitide kaupa joondatud
fr: {{#label}} la représentation décodée en hexadécimal doit être alignée sur l'octet
ja: {{#label}}16進数でデコードされた表現は、バイト・アラインされていなければならない

source: {{#label}} must be a valid hostname
de: {{#label}} muss ein gültiger Hostname sein
et: {{#label}} peab olema kehtiv hostinimi
fr: {{#label}} doit être un nom d'hôte valide
ja: {{#label}}は有効なホスト名でなければならない

source: {{#label}} must be a valid ip address with a {{#cidr}} CIDR
de: {{#label}} muss eine gültige IP-Adresse mit einem {{#cidr}} sein CIDR
et: {{#label}} peab olema kehtiv ip-aadress koos {{#cidr}} CIDR
fr: {{#label}} doit être une adresse IP valide avec un {{#cidr}} CIDR
ja: {{#label}}は{{#cidr}}の有効なIPアドレスでなければならない。CIDR

source: {{#label}} must be a valid ip address of one of the following versions {{#version}} with a {{#cidr}} CIDR
de: {{#label}} muss eine gültige IP-Adresse in einer der folgenden Versionen sein {{#version}} mit einem {{#cidr}} CIDR
et: {{#label}} peab olema kehtiva ip-aadressi üks järgmistest versioonidest {{#version}} koos {{#cidr}}-ga CIDR
fr: {{#label}} doit être une adresse IP valide de l'une des versions suivantes {{#version}} avec un {{#cidr}} CIDR
ja: {{#label}}は、次のいずれかのバージョンの有効なIPアドレス{{#version}}と{{#cidr}}でなければならない。CIDR

source: {{#label}} must be in iso format
de: {{#label}} muss im iso-Format sein
et: {{#label}} peab olema iso formaadis
fr: {{#label}} doit être au format iso
ja: {{#label}}はisoフォーマットでなければならない

source: {{#label}} must be a valid ISO 8601 duration
de: {{#label}} muss eine gültige ISO 8601-Dauer sein
et: {{#label}} peab olema kehtiv ISO 8601 kestus
fr: {{#label}} doit être une durée ISO 8601 valide
ja: {{#label}}は有効なISO 8601デュレーションでなければならない

source: {{#label}} length must be {{#limit}} characters long
de: {{#label}} Länge muss {{#limit}} Zeichen lang sein
et: {{#label}} pikkus peab olema {{#limit}} tähemärki
fr: La longueur de {{#label}} doit être de {{#limit}} caractères
ja: {{#label}}の長さは{{#limit}}文字でなければならない

source: {{#label}} must only contain lowercase characters
de: {{#label}} darf nur Kleinbuchstaben enthalten
et: {{#label}} peab sisaldama ainult väikseid tähemärke
fr: {{#label}} ne doit contenir que des caractères minuscules
ja: {{#label}}は小文字のみ

source: {{#label}} length must be less than or equal to {{#limit}} characters long
de: {{#label}} Länge muss kleiner oder gleich {{#limit}} Zeichen lang sein
et: {{#label}} pikkus peab olema väiksem või võrdne {{#limit}} tähemärgi pikkusega
fr: La longueur de {{#label}} doit être inférieure ou égale à {{#limit}} caractères
ja: {{#label}}の長さは{{#limit}}文字以下でなければならない

source: {{#label}} length must be at least {{#limit}} characters long
de: {{#label}} Länge muss mindestens {{#limit}} Zeichen lang sein
et: {{#label}} pikkus peab olema vähemalt {{#limit}} tähemärgi pikkune
fr: La longueur de {{#label}} doit être d'au moins {{#limit}} caractères
ja: {{#label}}の長さは少なくとも{{#limit}}文字でなければならない

source: {{#label}} must be unicode normalized in the {{#form}} form
de: {{#label}} muss unicode-normalisiert in der Form {{#form}} sein
et: {{#label}} peab olema unicode normaliseeritud kujul {{#form}}
fr: {{#label}} doit être normalisé en unicode sous la forme {{#form}}
ja: {{#label}}は{{#form}}形式でユニコード正規化されなければならない

source: {{#label}} must only contain alpha-numeric and underscore characters
de: {{#label}} darf nur alphanumerische Zeichen und Unterstriche enthalten
et: {{#label}} peab sisaldama ainult tähtnumbrilisi ja alatähti
fr: {{#label}} ne doit contenir que des caractères alphanumériques et des traits de soulignement
ja: {{#label}}には英数字とアンダースコアのみを含める

source: {{#label}} with value {:[.]} fails to match the required pattern: {{#regex}}
de: {{#label}} mit dem Wert {:[.]} stimmt nicht mit dem erforderlichen Muster überein: {{#regex}}
et: {{#label}} väärtusega {:[.]} ei vasta nõutavale mustrile: {{#regex}}
fr: {{#label}} avec la valeur {:[.]} ne correspond pas au modèle requis : {{#regex}}
ja: 値{:[.]}の{{#label}}は必須パターンにマッチしない：{{#regex}}

source: {{#label}} with value {:[.]} fails to match the {{#name}} pattern
de: {{#label}} mit dem Wert {:[.]} stimmt nicht mit dem Muster {{#name}} überein
et: {{#label}} väärtusega {:[.]} ei vasta {{#name}} mustrile
fr: {{#label}} avec la valeur {:[.]} ne correspond pas au motif {{#name}}
ja: 値{:[.]}の{{#label}}は{{#name}}パターンにマッチせず

source: {{#label}} with value {:[.]} matches the inverted pattern: {{#regex}}
de: {{#label}} mit dem Wert {:[.]} entspricht dem invertierten Muster: {{#regex}}
et: {{#label}} väärtusega {:[.]} vastab inverteeritud mustrile: {{#regex}}
fr: {{#label}} avec la valeur {:[.]} correspond au modèle inversé : {{#regex}}
ja: 値{:[.]}の{{#label}}は反転パターンにマッチする：{{#regex}}

source: {{#label}} with value {:[.]} matches the inverted {{#name}} pattern
de: {{#label}} mit dem Wert {:[.]} entspricht dem invertierten Muster {{#name}}
et: {{#label}} väärtusega {:[.]} vastab ümberpööratud {{#name}} mustrile
fr: {{#label}} avec la valeur {:[.]} correspond au modèle inversé {{#name}}
ja: 値{:[.]}の{{#label}}は、反転した{{#name}}パターンに一致する

source: {{#label}} must not have leading or trailing whitespace
de: {{#label}} darf keine führenden oder nachgestellten Leerzeichen enthalten
et: {{#label}} ei tohi olla ees- ega tagaotsas tühikuid
fr: {{#label}} ne doit pas comporter d'espace en début ou en fin de phrase
ja: {先頭または末尾に空白があってはならない

source: {{#label}} must be a valid uri
de: {{#label}} muss eine gültige Uri sein
et: {{#label}} peab olema kehtiv uri
fr: {{#label}} doit être un uri valide
ja: {{#label}}は有効なuriでなければならない

source: {{#label}} must be a valid uri with a scheme matching the {{#scheme}} pattern
de: {{#label}} muss eine gültige uri mit einem Schema sein, das dem Muster {{#scheme}} entspricht
et: {{#label}} peab olema kehtiv uri, mille skeem vastab {{#scheme}} mustrile
fr: {{#label}} doit être un uri valide avec un schéma correspondant au modèle {{#scheme}}
ja: {{#label}}は{{#scheme}}パターンにマッチするスキームを持つ有効なuriでなければならない

source: {{#label}} must be a valid relative uri
de: {{#label}} muss eine gültige relative uri sein
et: {{#label}} peab olema kehtiv suhteline uri
fr: {{#label}} doit être un uri relatif valide
ja: {{#label}}は有効な相対URIでなければならない

source: {{#label}} must only contain uppercase characters
de: {{#label}} darf nur Großbuchstaben enthalten
et: {{#label}} peab sisaldama ainult suurtähtedega tähemärke
fr: {{#label}} ne doit contenir que des caractères majuscules
ja: {{#label}}は大文字のみ

source: {{#label}} must be a symbol
de: {{#label}} muss ein Symbol sein
et: {{#label}} peab olema sümbol
fr: {{#label}} doit être un symbole
ja: {{#label}}は記号でなければならない

source: {{#label}} must be one of {{#map}}
de: {{#label}} muss einer von {{#map}} sein
et: {{#label}} peab olema üks järgmistest {{#map}}
fr: {{#label}} doit être l'un des {{#map}}
ja: {{#label}}は{{#map}}のいずれかでなければならない

source: {{#label}} must be a buffer or a string
de: {{#label}} muss ein Puffer oder ein String sein
et: {{#label}} peab olema puhver või string
fr: {{#label}} doit être un tampon ou une chaîne de caractères
ja: {{#label}}はバッファか文字列でなければならない

source: {{#label}} must be {{#limit}} bytes
de: {{#label}} muss {{#limit}} Bytes sein
et: {{#label}} peab olema {{#limit}} baiti
fr: {{#label}} doit être {{#limit}} octets
ja: {{#label}}は{{#limit}}バイトでなければならない

source: {{#label}} must be less than or equal to {{#limit}} bytes
de: {{#label}} muss kleiner als oder gleich {{#limit}} Bytes sein
et: {{#label}} peab olema väiksem või võrdne {{#limit}} baidiga
fr: {{#label}} doit être inférieur ou égal à {{#limit}} octets
ja: {{#label}}は{{#limit}}バイト以下でなければならない

source: {{#label}} must be at least {{#limit}} bytes
de: {{#label}} muss mindestens {{#limit}} Bytes betragen
et: {{#label}} peab olema vähemalt {{#limit}} baiti
fr: {{#label}} doit être d'au moins {{#limit}} octets
ja: {{#label}}は少なくとも{{#limit}}バイトでなければならない
