Repository: jakubmieszczanin/joi-messages
Catalog: translations/*.po
Languages: de, et, fr, ja

source: {{#label}} failed custom validation because {{#error.message}}
de: {{#label}} hat die benutzerdefinierte Validierung nicht bestanden, weil {{#error.message}}
et: {{#label}} ebaõnnestus kohandatud valideerimine, sest {{#error.message}}
fr: La validation personnalisée de {{#label}} a échoué car {{#error.message}}
ja: {{#label}}はカスタムバリデーションに失敗した

source: {{#label}} threw an error when running default method
de: {{#label}} hat bei der Ausführung der Standardmethode einen Fehler verursacht
et: {{#label}} tekitas vea, kui käivitas vaikimisi meetodi
fr: Une erreur s'est produite lors de l'exécution de la méthode par défaut {{#label}}
ja: デフォルト・メソッドの実行時に {{#label}} がエラーをスローした

source: {{#label}} threw an error when running failover method
de: {{#label}} hat bei der Ausführung der Failover-Methode einen Fehler verursacht
et: {{#label}} tekitas vea failover meetodi käivitamisel
fr: {Une erreur s'est produite lors de l'exécution de la méthode de basculement
ja: フェイルオーバー・メソッドの実行時に{{#label}}エラーが発生しました

source: {{#label}} contains an invalid value
de: {{#label}} enthält einen ungültigen Wert
et: {{#label}} sisaldab kehtetut väärtust
fr: {{#label}} contient une valeur non valide
ja: {{#label}}に無効な値が含まれている

source: {{#label}} must be {if(#valids.length == 1, "", "one of ")}{{#valids}}
de: {{#label}} muss {if(#valids.length == 1, "", "einer von ")}{{#valids}} sein
et: {{#label}} peab olema {if(#valids.length == 1, "", "üks järgmistest ")}{{#valids}}
fr: {{#label}} doit être {if(#valids.length == 1, "", "one of ")}{{#valids}}
ja: {{#label}}は{if(#valids.length == 1, "", "one of ")}{{#valids}}でなければならない

source: {{#label}} {{#arg}} references {{:#ref}} which {{#reason}}
de: {{#label}} {{#arg}} verweist auf {{:#ref}}, die {{#reason}}
et: {{#label}} {{#arg}} viitab {{:#ref}}, mis {{#reason}}
fr: {{#label}} {{#arg}} les références {{:#ref}} qui {{#reason}}
ja: {{#label}}1]}は{{:#ref}}を参照し、{{#reason}}は{{#arg}}を参照する

source: {{#label}} is required
de: {{#label}} ist erforderlich
et: {{#label}} on nõutav
fr: {{#label}} est nécessaire
ja: {{#label}}が必要

source: {{#label}} is not allowed
de: {{#label}} ist nicht erlaubt
et: {{#label}} ei ole lubatud
fr: {{#label}} n'est pas autorisé
ja: {{#label}}は許されない

source: {{#label}} does not match all of the required types
de: {{#label}} stimmt nicht mit allen erforderlichen Typen überein
et: {{#label}} ei vasta kõigile nõutavatele tüüpidele
fr: {{#label}} ne correspond pas à tous les types requis
ja: {{#label}}は必要なすべての型にマッチしない

source: {{#label}} does not match any of the allowed types
de: {{#label}} stimmt mit keinem der zulässigen Typen überein
et: {{#label}} ei vasta ühelegi lubatud tüübile
fr: {{#label}} ne correspond à aucun des types autorisés
ja: {{#label}}は許可されたタイプのいずれにもマッチしない

source: {{#label}} matches more than one allowed type
de: {{#label}} entspricht mehr als einem zulässigen Typ
et: {{#label}} vastab rohkem kui ühele lubatud tüübile
fr: {{#label}} correspond à plus d'un type autorisé
ja: {{#label}}は複数の許容タイプにマッチする

source: {{#label}} must be one of {{#types}}
de: {{#label}} muss einer von {{#types}} sein
et: {{#label}} peab olema üks järgmistest {{#types}}
fr: {{#label}} doit être l'un des {{#types}}
ja: {{#label}}は{{#types}}のいずれかでなければならない

source: {{#label}} must be an array
de: {{#label}} muss ein Array sein
et: {{#label}} peab olema massiivi
fr: {{#label}} doit être un tableau
ja: {{#label}}は配列でなければならない

source: {{#label}} contains an excluded value
de: {{#label}} enthält einen ausgeschlossenen Wert
et: {{#label}} sisaldab välistatud väärtust
fr: {{#label}} contient une valeur exclue
ja: {{#label}}が除外値を含む

source: {{#label}} does not contain at least one required match for type {:#patternLabel}
de: {{#label}} enthält nicht mindestens eine erforderliche Übereinstimmung für Typ {:#patternLabel}
et: {{#label}} ei sisalda vähemalt ühte nõutavat vastet tüübile {:#patternLabel}
fr: {{#label}} ne contient pas au moins une correspondance requise pour le type {:#patternLabel}
ja: {{#label}}がタイプ{:#patternLabel}の必須一致を少なくとも1つ含んでいない

source: {{#label}} does not contain at least one required match
de: {{#label}} enthält nicht mindestens eine erforderliche Übereinstimmung
et: {{#label}} ei sisalda vähemalt ühte nõutavat vastet
fr: {{#label}} ne contient pas au moins une correspondance requise
ja: {{#label}}が少なくとも1つの必須一致を含まない

source: {{#label}} does not contain {{#knownMisses}} and {{#unknownMisses}} other required value(s)
de: {{#label}} enthält nicht {{#knownMisses}} und {{#unknownMisses}} andere erforderliche(n) Wert(e)
et: {{#label}} ei sisalda {{#knownMisses}} ja {{#unknownMisses}} muid nõutavaid väärtusi
fr: {{#label}} ne contient pas {{#knownMisses}} et {{#unknownMisses}} d'autre(s) valeur(s) requise(s)
ja: {{#label}}は{{#knownMisses}}と{{#unknownMisses}}を含まない

source: {{#label}} does not contain {{#knownMisses}}
de: {{#label}} enthält nicht {{#knownMisses}}
et: {{#label}} ei sisalda {{#knownMisses}}
fr: {{#label}} ne contient pas {{#knownMisses}}
ja: {{#label}}は{{#knownMisses}}を含まない

source: {{#label}} does not contain {{#unknownMisses}} required value(s)
de: {{#label}} enthält nicht {{#unknownMisses}} erforderlichen Wert(e)
et: {{#label}} ei sisalda {{#unknownMisses}} nõutud väärtust (väärtusi)
fr: {{#label}} ne contient pas de {{#unknownMisses}} valeur(s) requise(s)
ja: {{#label}}に{{#unknownMisses}}の必須値が含まれていない

source: {{#label}} must contain {{#limit}} items
de: {{#label}} muss {{#limit}} Elemente enthalten
et: {{#label}} peab sisaldama {{#limit}} elemente
fr: {{#label}} doit contenir des éléments {{#limit}}
ja: {{#label}}には{{#limit}}項目が含まれていなければならない

source: {{#label}} must contain less than or equal to {{#limit}} items
de: {{#label}} muss weniger als oder gleich {{#limit}} Elemente enthalten
et: {{#label}} peab sisaldama vähem või võrdselt {{#limit}} elemente
fr: {{#label}} doit contenir un nombre d'éléments inférieur ou égal à {{#limit}}
ja: {{#label}}には{{#limit}}以下の項目が含まれていなければならない

source: {{#label}} must contain at least {{#limit}} items
de: {{#label}} muss mindestens {{#limit}} Elemente enthalten
et: {{#label}} peab sisaldama vähemalt {{#limit}} elemente
fr: {{#label}} doit contenir au moins des éléments {{#limit}}
ja: {{#label}}には少なくとも{{#limit}}項目が含まれていなければならない

source: {{#label}} must contain at most {{#limit}} items
de: {{#label}} darf höchstens {{#limit}} Elemente enthalten
et: {{#label}} peab sisaldama maksimaalselt {{#limit}} elemente
fr: {{#label}} doit contenir au plus des éléments {{#limit}}
ja: {{#label}}は最大でも{{#limit}}の項目を含まなければならない

source: {{#label}} must be sorted in {#order} order by {{#by}}
de: {{#label}} muss in der Reihenfolge {#order} nach {{#by}} sortiert werden
et: {{#label}} peab olema sorteeritud {#order} järjekorras {{#by}} järgi
fr: {{#label}} doit être trié dans l'ordre {#order} par {{#by}}
ja: {{#label}}は{{#by}}によって{#order}順にソートされなければならない

source: {{#label}} cannot be sorted due to mismatching types
de: {{#label}} kann nicht sortiert werden, da die Typen nicht übereinstimmen
et: {{#label}} ei saa sorteerida, kuna tüübid ei vasta üksteisele
fr: {{#label}} ne peut être trié en raison de la non-concordance des types
ja: 型が不一致のため{{#label}}はソートできない

source: {{#label}} cannot be sorted due to unsupported type {#type}
de: {{#label}} kann aufgrund eines nicht unterstützten Typs nicht sortiert werden {#type}
et: {{#label}} ei saa sorteerida, kuna tüüp ei ole toetatud {#type}
fr: {{#label}} ne peut être trié en raison d'un type non pris en charge {#type}
ja: {{#label}}はサポートされていない型{#type}のためソートできない

source: {{#label}} must not be a sparse array item
de: {{#label}} darf kein Element einer dünn besetzten Matrix sein
et: {{#label}} ei tohi olla hõreda massiivi element
fr: {{#label}} ne doit pas être un élément de tableau épars
ja: {{#label}}は疎な配列項目であってはならない

source: {{#label}} contains a duplicate value
de: {{#label}} enthält einen doppelten Wert
et: {{#label}} sisaldab dubleeritud väärtust
fr: {{#label}} contient une valeur en double
ja: {{#label}}に重複値が含まれている

source: {{#label}} must be a boolean
de: {{#label}} muss ein boolescher Wert sein
et: {{#label}} peab olema boolean
fr: {{#label}} doit être un booléen
ja: {{#label}}はブール値でなければならない

source: {{#label}} must be a valid date
de: {{#label}} muss ein gültiges Datum sein
et: {{#label}} peab olema kehtiv kuupäev
fr: {{#label}} doit être une date valide
ja: {{#label}}は有効な日付でなければならない

source: {{#label}} must be in {msg("date.format." + #format) || #format} format
de: {{#label}} muss im Format {msg("date.format." + #format) || #format} sein
et: {{#label}} peab olema {msg("date.format." + #format) || #format} formaadis
fr: {{#label}} doit être dans le format {msg("date.format." + #format) || #format}
ja: {{#label}}は{msg("date.format." + #format)||#format}形式でなければならない

source: {{#label}} must be greater than {{:#limit}}
de: {{#label}} muss größer sein als {{:#limit}}
et: {{#label}} peab olema suurem kui {{:#limit}}
fr: {{#label}} doit être supérieur à {{:#limit}}
ja: {{#label}}は{{:#limit}}より大きくなければならない

source: {{#label}} must be less than {{:#limit}}
de: {{#label}} muss kleiner sein als {{:#limit}}
et: {{#label}} peab olema väiksem kui {{:#limit}}
fr: {{#label}} doit être inférieur à {{:#limit}}
ja: {{#label}}は{{:#limit}}より小さくなければならない

source: {{#label}} must be less than or equal to {{:#limit}}
de: {{#label}} muss kleiner als oder gleich {{:#limit}} sein
et: {{#label}} peab olema väiksem või võrdne {{:#limit}}
fr: {{#label}} doit être inférieur ou égal à {{:#limit}}
ja: {{#label}}は{{:#limit}}以下でなければならない

source: {{#label}} must be greater than or equal to {{:#limit}}
de: {{#label}} muss größer als oder gleich {{:#limit}} sein
et: {{#label}} peab olema suurem või võrdne {{:#limit}}
fr: {{#label}} doit être supérieur ou égal à {{:#limit}}
ja: {{#label}}は{{:#limit}}以上でなければならない

source: ISO 8601 date
de: ISO 8601 Datum
et: ISO 8601 kuupäev
fr: Date ISO 8601
ja: ISO 8601日付

source: timestamp or number of milliseconds
de: Zeitstempel oder Anzahl der Millisekunden
et: ajatempel või millisekundid
fr: Horodatage ou nombre de millisecondes
ja: タイムスタンプまたはミリ秒数

source: timestamp or number of seconds
de: Zeitstempel oder Anzahl der Sekunden
et: ajatempel või sekundid
fr: Horodatage ou nombre de secondes
ja: タイムスタンプまたは秒数

source: {{#label}} contains {{#presentWithLabels}} without its required peers {{#missingWithLabels}}
de: {{#label}} enthält {{#presentWithLabels}} ohne die erforderlichen Gegenstücke {{#missingWithLabels}}
et: {{#label}} sisaldab {{#presentWithLabels}} ilma selle nõutavate eakaaslasteta {{#missingWithLabels}}
fr: {{#label}} contient {{#presentWithLabels}} sans ses pairs {{#missingWithLabels}}
ja: 0]}は{{#presentWithLabels}}を含み、{{#missingWithLabels}}は必要なピア{{#presentWithLabels}}を含まない

source: {{#label}} is invalid because {if(#subject.key, `"` + #subject.key + `" failed to ` + (#message || "pass the assertion test"), #message || "the assertion failed")}
de: {{#label}} ist ungültig, weil {if(#subject.key, `"` + #subject.key + `" failed to ` + (#message || "pass the assertion test"), #message || "the assertion failed")}
et: {{#label}} on kehtetu, sest {if(#subject.key, `"` + #subject.key + `" ei õnnestunud ` + (#message || "läbida väite test"), #message || "väide ebaõnnestus")}
fr: {{#label}} est invalide car {if(#subject.key, `"` + #subject.key + `" failed to ` + (#message || "pass the assertion test"), #message || "the assertion failed")}
ja: {if(#subject.key, `"` + #subject.key + `" failed to ` + (#message || "アサーションテストに合格"), #message || "アサーションに失敗")}のため、{{#label}}は無効です

source: {{#label}} must be of type {{#type}}
de: {{#label}} muss vom Typ {{#type}} sein
et: {{#label}} peab olema {{#type}} tüüpi
fr: {{#label}} doit être du type {{#type}}
ja: {{#label}}は{{#type}}型でなければならない

source: {{#label}} must be an instance of {{:#type}}
de: {{#label}} muss eine Instanz von {{:#type}} sein
et: {{#label}} peab olema {{:#type}} eksemplar
fr: {{#label}} doit être une instance de {{:#type}}
ja: {{#label}}は{{:#type}}のインスタンスでなければならない

source: {{#label}} must have {{#limit}} key{if(#limit == 1, "", "s")}
de: {{#label}} muss {{#limit}} Schlüssel haben{if(#limit == 1, "", "s")}
et: {{#label}} peab olema {{#limit}} key{if(#limit == 1, "", "s")}
fr: {{#label}} doit avoir {{#limit}} clé{if(#limit == 1, "", "s")}
ja: {{#label}}は{{#limit}}キー{if(#limit == 1, "", "s")}を持っていなければならない

source: {{#label}} must have less than or equal to {{#limit}} key{if(#limit == 1, "", "s")}
de: {{#label}} muss kleiner als oder gleich {{#limit}} sein key{if(#limit == 1, "", "s")}
et: {{#label}} peab sisaldama kuni {{#limit}} võti{if(#limit == 1, "", "t")}
fr: {{#label}} doit être inférieur ou égal à {{#limit}} clé{if(#limit == 1, "", "s")}
ja: {{#label}}は{{#limit}}以下でなければならないキー{if(#limit == 1, "", "s")}

source: {{#label}} must have at least {{#limit}} key{if(#limit == 1, "", "s")}
de: {{#label}} muss mindestens {{#limit}} Schlüssel haben{if(#limit == 1, "", "s")}
et: {{#label}} peab sisaldama vähemalt {{#limit}} võti{if(#limit == 1, "", "t")}
fr: {{#label}} doit avoir au moins {{#limit}} clé{if(#limit == 1, "", "s")}
ja: {{#label}}は少なくとも{{#limit}}キー{if(#limit == 1, "", "s")}を持っていなければならない

source: {{#label}} must contain at least one of {{#peersWithLabels}}
de: {{#label}} muss mindestens eines von {{#peersWithLabels}} enthalten
et: {{#label}} peab sisaldama vähemalt ühte {{#peersWithLabels}}
fr: {{#label}} doit contenir au moins un {{#peersWithLabels}}
ja: {{#label}}は{{#peersWithLabels}}を少なくとも1つ含んでいなければならない

source: {{:#mainWithLabel}} must not exist simultaneously with {{#peersWithLabels}}
de: {{:#mainWithLabel}} darf nicht gleichzeitig mit {{#peersWithLabels}} existieren
et: {{:#mainWithLabel}} ei tohi eksisteerida samaaegselt {{#peersWithLabels}}-ga
fr: {{:#mainWithLabel}} ne doit pas exister en même temps que {{#peersWithLabels}}
ja: {{#label}}は{{#peersWithLabels}}と同時に存在してはならない

source: {{#label}} contains a conflict between optional exclusive peers {{#peersWithLabels}}
de: {{#label}} enthält einen Konflikt zwischen optionalen exklusiven Gleichrangigen {{#peersWithLabels}}
et: {{#label}} sisaldab konflikti vabatahtlike eksklusiivsete eakaaslaste {{#peersWithLabels}} vahel
fr: {{#label}} contient un conflit entre des pairs exclusifs facultatifs {{#peersWithLabels}}
ja: {{#label}}には、オプションの排他的ピア{{#peersWithLabels}}間の競合が含まれている

source: {{#label}} keys failed to match pattern requirements
de: {{#label}} Schlüssel entsprechen nicht den Musteranforderungen
et: {{#label}} võtmed ei vastanud mustri nõuetele
fr: Les clés {{#label}} ne correspondent pas aux exigences du modèle
ja: {{#label}}キーがパターン要件にマッチしなかった

source: {{#label}} must be a Joi reference
de: {{#label}} muss eine Joi-Referenz sein
et: {{#label}} peab olema Joi viide
fr: {{#label}} doit être une référence Joi
ja: {{#label}}はジョイ・レファレンスでなければならない

source: {{#label}} must be a RegExp object
de: {{#label}} muss ein RegExp-Objekt sein
et: {{#label}} peab olema RegExp objekt
fr: {{#label}} doit être un objet RegExp
ja: {{#label}}はRegExpオブジェクトでなければならない

source: {{#label}} cannot rename {{:#from}} because multiple renames are disabled and another key was already renamed to {{:#to}}
de: {{#label}} kann nicht in {{:#from}} umbenannt werden, da Mehrfachumbenennungen deaktiviert sind und ein anderer Schlüssel bereits in {{:#to}} umbenannt wurde
et: {{#label}} ei saa ümber nimetada {{:#from}}, sest mitmekordne ümbernimetamine on keelatud ja teine võti on juba ümber nimetatud {{:#to}}
fr: {{#label}} ne peut pas renommer {{:#from}} parce que les renommages multiples sont désactivés et qu'une autre clé a déjà été renommée en {{:#to}}
ja: {{#label}}は{{:#from}}の名前を変更できない。なぜなら、複数の名前の変更が無効になっており、別のキーがすでに{{:#to}}にリネームされているからである

source: {{#label}} cannot rename {{:#from}} because override is disabled and target {{:#to}} exists
de: {{#label}} kann nicht in {{:#from}} umbenannt werden, da Überschreibung deaktiviert ist und das Ziel {{:#to}} existiert
et: {{#label}} ei saa ümber nimetada {{:#from}}, sest ülevõtmine on keelatud ja sihtmärk {{:#to}} on olemas
fr: {{#label}} ne peut pas renommer {{:#from}} car l'annulation est désactivée et la cible {{:#to}} existe
ja: オーバーライドが無効でターゲット{{:#to}}が存在するため、{{#label}}は{{:#from}}の名前を変更できない

source: {{#label}} must be a Joi schema of {{#type}} type
de: {{#label}} muss ein Joi-Schema vom Typ {{#type}} sein
et: {{#label}} peab olema {{#type}} tüüpi Joi skeem
fr: {{#label}} doit être un schéma Joi de type {{#type}}
ja: {{#label}}は{{#type}}型のジョイ・スキーマでなければならない

source: {{:#mainWithLabel}} missing required peer {{:#peerWithLabel}}
de: {{:#mainWithLabel}} fehlender erforderlicher Peer {{:#peerWithLabel}}
et: {{:#mainWithLabel}} puudub nõutav partner {{:#peerWithLabel}}
fr: {{:#mainWithLabel}} missing required peer {{:#peerWithLabel}} (pair manquant)
ja: {{#label}}必須ピア{{:#peerWithLabel}}が見つからない

source: {{:#mainWithLabel}} conflict with forbidden peer {{:#peerWithLabel}}
de: {{:#mainWithLabel}} Konflikt mit verbotener Gegenstelle {{:#peerWithLabel}}
et: {{:#mainWithLabel}} konflikt keelatud partneriga {{:#peerWithLabel}}
fr: {{:#mainWithLabel}} conflit avec un pair interdit {{:#peerWithLabel}}
ja: {{#label}}は禁止されたピア{{:#peerWithLabel}}と衝突する

source: {{#label}} contains a conflict between exclusive peers {{#peersWithLabels}}
de: {{#label}} enthält einen Konflikt zwischen exklusiven Gleichrangigen {{#peersWithLabels}}
et: {{#label}} sisaldab konflikti eksklusiivsete eakaaslaste {{#peersWithLabels}} vahel
fr: {{#label}} contient un conflit entre des pairs exclusifs {{#peersWithLabels}}
ja: {{#label}}は排他的ピア{{#peersWithLabels}}間の競合を含んでいる

source: {{#label}} must have an arity of {{#n}}
de: {{#label}} muss eine Arität von {{#n}} haben
et: {{#label}} peab olema ariteediga {{#n}}
fr: {{#label}} doit avoir un arité de {{#n}}
ja: {{#label}}は{{#n}}のアリティを持たなければならない

source: {{#label}} must be a class
de: {{#label}} muss eine Klasse sein
et: {{#label}} peab olema klass
fr: {{#label}} doit être une classe
ja: {{#label}}はクラスでなければならない

source: {{#label}} must have an arity lesser or equal to {{#n}}
de: {{#label}} muss eine Arität kleiner oder gleich {{#n}} haben
et: {{#label}} peab olema väiksema või võrdse ariteediga kui {{#n}}
fr: {{#label}} doit avoir une arité inférieure ou égale à {{#n}}
ja: {{#label}}は{{#n}}以下のアリティでなければならない

source: {{#label}} must have an arity greater or equal to {{#n}}
de: {{#label}} muss eine Arität größer oder gleich {{#n}} haben
et: {{#label}} peab olema ariteediga {{#n}} või sellega võrdne
fr: {{#label}} doit avoir un arité supérieur ou égal à {{#n}}
ja: {{#label}}は{{#n}}以上のアリティを持たなければならない

source: {{#label}} must be a number
de: {{#label}} muss eine Zahl sein
et: {{#label}} peab olema number
fr: {{#label}} doit être un nombre
ja: {{#label}}は数字でなければならない

source: {{#label}} must be greater than {{#limit}}
de: {{#label}} muss größer sein als {{#limit}}
et: {{#label}} peab olema suurem kui {{#limit}}
fr: {{#label}} doit être supérieur à {{#limit}}
ja: {{#label}}は{{#limit}}より大きくなければならない

source: {{#label}} cannot be infinity
de: {{#label}} kann nicht unendlich sein
et: {{#label}} ei saa olla lõpmatus
fr: {{#label}} ne peut pas être l'infini
ja: {{#label}}を無限大にすることはできない

source: {{#label}} must be an integer
de: {{#label}} muss eine ganze Zahl sein
et: {{#label}} peab olema täisarv
fr: {{#label}} doit être un nombre entier
ja: {{#label}}は整数でなければならない

source: {{#label}} must be less than {{#limit}}
de: {{#label}} muss kleiner sein als {{#limit}}
et: {{#label}} peab olema väiksem kui {{#limit}}
fr: {{#label}} doit être inférieur à {{#limit}}
ja: {{#label}}は{{#limit}}より小さくなければならない

source: {{#label}} must be less than or equal to {{#limit}}
de: {{#label}} muss kleiner als oder gleich {{#limit}} sein
et: {{#label}} peab olema väiksem või võrdne {{#limit}}
fr: {{#label}} doit être inférieur ou égal à {{#limit}}
ja: {{#label}}は{{#limit}}以下でなければならない

source: {{#label}} must be greater than or equal to {{#limit}}
de: {{#label}} muss größer als oder gleich {{#limit}} sein
et: {{#label}} peab olema suurem või võrdne {{#limit}}
fr: {{#label}} doit être supérieur ou égal à {{#limit}}
ja: {{#label}}は{{#limit}}以上でなければならない

source: {{#label}} must be a multiple of {{#multiple}}
de: {{#label}} muss ein Vielfaches von {{#multiple}} sein
et: {{#label}} peab olema {{#multiple}} kordne
fr: {{#label}} doit être un multiple de {{#multiple}}
ja: {{#label}}は{{#multiple}}の倍数でなければならない

source: {{#label}} must be a negative number
de: {{#label}} muss eine negative Zahl sein
et: {{#label}} peab olema negatiivne arv
fr: {{#label}} doit être un nombre négatif
ja: {{#label}}は負数でなければならない

source: {{#label}} must be a valid port
de: {{#label}} muss ein gültiger Anschluss sein
et: {{#label}} peab olema kehtiv port
fr: {{#label}} doit être un port valide
ja: {{#label}}は有効なポートでなければならない

source: {{#label}} must be a positive number
de: {{#label}} muss eine positive Zahl sein
et: {{#label}} peab olema positiivne arv
fr: {{#label}} doit être un nombre positif
ja: {{#label}}は正の数でなければならない

source: {{#label}} must have no more than {{#limit}} decimal places
de: {{#label}} darf nicht mehr als {{#limit}} Nachkommastellen haben
et: {{#label}} ei tohi olla rohkem kui {{#limit}} kümnendikohta
fr: {{#label}} ne doit pas avoir plus de {{#limit}} décimales
ja: {{#label}}の小数点以下桁数は{{#limit}}以下でなければならない

source: {{#label}} must be a safe number
de: {{#label}} muss eine sichere Zahl sein
et: {{#label}} peab olema turvaline number
fr: {{#label}} doit être un nombre sûr
ja: {{#label}}は安全な数字でなければならない

source: {{#label}} must only contain alpha-numeric characters
de: {{#label}} darf nur alphanumerische Zeichen enthalten
et: {{#label}} peab sisaldama ainult tähtnumbrilisi sümboleid
fr: {{#label}} ne doit contenir que des caractères alphanumériques
ja: {{#label}}は英数字のみ

source: {{#label}} must be a string
de: {{#label}} muss eine Zeichenkette sein
et: {{#label}} peab olema string
fr: {{#label}} doit être une chaîne de caractères
ja: {{#label}}は文字列でなければならない

source: {{#label}} must be a valid base64 string
de: {{#label}} muss eine gültige base64-Zeichenkette sein
et: {{#label}} peab olema kehtiv base64 string
fr: {{#label}} doit être une chaîne base64 valide
ja: {{#label}}は有効なbase64文字列でなければならない

source: {{#label}} must be a credit card
de: {{#label}} muss eine Kreditkarte sein
et: {{#label}} peab olema krediitkaart
fr: {{#label}} doit être une carte de crédit
ja: {{#label}}はクレジットカードでなければならない

source: {{#label}} must be a valid dataUri string
de: {{#label}} muss eine gültige dataUri-Zeichenkette sein
et: {{#label}} peab olema kehtiv dataUri string
fr: {{#label}} doit être une chaîne dataUri valide
ja: {{#label}}は有効なdataUri文字列でなければなりません

source: {{#label}} must contain a valid domain name
de: {{#label}} muss einen gültigen Domänennamen enthalten
et: {{#label}} peab sisaldama kehtivat domeeninime
fr: {{#label}} doit contenir un nom de domaine valide
ja: {{#label}}には有効なドメイン名が含まれていなければならない

source: {{#label}} must be a valid email
de: {{#label}} muss eine gültige E-Mail sein
et: {{#label}} peab olema kehtiv e-posti aadress
fr: {{#label}} doit être un email valide
ja: {{#label}}は有効なEメールでなければなりません

source: {{#label}} is not allowed to be empty
de: {{#label}} darf nicht leer sein
et: {{#label}} ei tohi olla tühi
fr: {{#label}} ne peut être vide
ja: {{#label}}が空であることは許されない

source: {{#label}} must be a valid GUID
de: {{#label}} muss eine gültige GUID sein
et: {{#label}} peab olema kehtiv GUID
fr: {{#label}} doit être un GUID valide
ja: {{#label}}は有効なGUIDでなければならない

source: {{#label}} must only contain hexadecimal characters
de: {{#label}} darf nur hexadezimale Zeichen enthalten
et: {{#label}} peab sisaldama ainult kuueteistkümnendmärke
fr: {{#label}} ne doit contenir que des caractères hexadécimaux
ja: {{#label}}には16進数の文字のみを含めること
